---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OptionSetId
source: html/09527fdf-9113-b53b-8156-60aea4ce650a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OptionSetId Property

"Design Option Set Id"

## Syntax (C#)
```csharp
public static ForgeTypeId OptionSetId { get; }
```